In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series
from numpy.random import randn

In [2]:
series = Series(randn(6), index=[[1, 1, 1, 2, 2, 2], ['a', 'b', 'c', 'a', 'b', 'c']])
series # Pandas matches the first index list with second one.

1  a    1.713474
   b    0.659174
   c    0.570421
2  a   -0.877932
   b   -0.875086
   c   -0.572303
dtype: float64

In [3]:
series.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [4]:
series[1]

a    1.713474
b    0.659174
c    0.570421
dtype: float64

In [5]:
series[2]

a   -0.877932
b   -0.875086
c   -0.572303
dtype: float64

In [6]:
series[1, 'a']

1.713474096461996

In [7]:
series[:, 'a']

1    1.713474
2   -0.877932
dtype: float64

In [8]:
dframe = series.unstack()
dframe

          a         b         c
1  1.713474  0.659174  0.570421
2 -0.877932 -0.875086 -0.572303

In [9]:
dframe2 = DataFrame(np.arange(16).reshape(4, 4), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                   columns=[['NY', 'NY', 'LA', 'SF'], ['cold', 'hot', 'hot', 'cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [10]:
dframe2['NY']

     cold  hot
a 1     0    1
  2     4    5
b 1     8    9
  2    12   13

In [11]:
dframe2.index.names = ['INDEX_1', 'INDEX_2']
dframe2.columns.names = ['CITIES', 'TEMPERATURE']
dframe2

CITIES            NY      LA   SF
TEMPERATURE     cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [12]:
dframe2.swaplevel('CITIES', 'TEMPERATURE', axis=1) # Axis = 1 -> column level swap

TEMPERATURE     cold hot     cold
CITIES            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [13]:
dframe2.sort_index(level=1) # Sort by index name 0 - INDEX_1 sort (a, a, b, b), 1 - INDEX_2 sort (1, 1, 2, 2)

CITIES            NY      LA   SF
TEMPERATURE     cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [14]:
dframe2

CITIES            NY      LA   SF
TEMPERATURE     cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [15]:
dframe2.sum(level='TEMPERATURE', axis=1) # Sum of columns on temperature levels
# This takes both cold / hot columns and adds their individual values to their cold / hot counterparts

TEMPERATURE      cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27